app/views/users/index.html.erb

        <td><%= link_to user.name, user%></td>
        <td> <% user.tasks.last(1).each do |u| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY "tasks"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

        </td>
        <td> <% user.tasks.last(1).each do |u| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY "tasks"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]