app/views/users/show.html.erb

  <tbody>
    <% @user.tasks.each do |a| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]

        </td>
        <!--<td><%#=Task.all.collect{ |u| u.t_title }%></td> -->
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY "tasks"."id" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]