app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks" LIMIT $1  [["LIMIT", 1]]

  def create
    #@user = User.find(params[:task][:user_id])
    @user = User.find(params[:user_id])
    @task = @user.tasks.create(task_params)

    respond_to do |format|
      if @task.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
INSERT INTO "tasks" ("t_title", "t_descn", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["t_title", "1"], ["t_descn", "1"], ["created_at", "2020-11-17 04:33:29.092829"], ["updated_at", "2020-11-17 04:33:29.092829"], ["user_id", 18]]
INSERT INTO "tasks" ("t_title", "t_descn", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["t_title", "1"], ["t_descn", "1"], ["created_at", "2020-11-04 01:24:13.394205"], ["updated_at", "2020-11-04 01:24:13.394205"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "t_title" = $1, "t_descn" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["t_title", "22ww"], ["t_descn", "22ww"], ["updated_at", "2020-11-17 04:33:52.373803"], ["id", 28]]