app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY user_name
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def index
    @users = User.all
    @users = User.order('name')
    @task = Task.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" ORDER BY updated_at DESC
---
  def show
    @user = User.find(params[:id])
    @task = @user.tasks
    @tasks = @task.order('updated_at DESC')

INSERT INTO "users" ("name", "active_job", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Baiden"], ["active_job", ""], ["created_at", "2020-11-10 06:18:01.403990"], ["updated_at", "2020-11-10 06:18:01.403990"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "active_job" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["active_job", "1"], ["updated_at", "2020-11-10 06:33:33.935356"], ["id", 14]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)